# Irish Ag CA2

Countries chosen for this analysis are Ireland, Germany, Austrailia.

This analysis will focus on the Irish agricultural landscape and the impact that the move towards a more plant based diet has had on it's production/ imports/ exports in comparrison to other counties wehere veganism is also on the rise. 

From the Europe Dataset, the analysis will focus on Ireland, which will be the baseline for all analysis and then Germany. The Irish agriculture findings will then be compared against Germany as both countries benifit from the European Common agricultural Policy. The analysis will be looking for similarities & differences in each countries agriculture indistry. Germany has been chosen as a country for analysis as it is one of the countries with the highest % of vegans in Europe.

The analysis will go on to compare Irish agriculure against  Austraulia, one of the largest vegan populations in the world who do not benifit from being a member of the CAP.

## Import Initial Libraries 

Import Pandas and Numpy libraries. 

Pandas is a Python library used for data analysis. The Pandas library enables DataFrame and Series functionality used for analyzing the data. This library works with the tabular data, i.e data that is organized in a table with rows(observations) and columns(features). 

NumPy is a Python library used to perform mathematical and computing operations specific to arrays. The NumPy module works with the numerical data.
https://numpy.org/doc/stable/

Seaborn and Matplotlib libraries are used for data visualisation purposes to generate plots, graphs and other visuaisations of data.

In [1]:
#data manipulation libraries
import pandas as pd
import numpy as np

# data visualization Libraries
import seaborn as sns
from matplotlib import pyplot as plt

## Python Good Practice 
The following are also good practice to run at the start of every Analysis project to ensure the best results

In [2]:
# filter warnings
import warnings
warnings.filterwarnings("ignore")

# avoid blurry images
%config InLineBackend.figure_format = "retina"
sns.set_context=("talk")

# enable multiple cell outputs
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

## Import Datasets

There is both production and import/export of goods data available on https://www.fao.org/faostat/en/#data/QCL for all continents.

In this section both production and import/export data for Europe, Americas & Oceanias will be imported. Later this data will be go through EDA and data cleaning before moving onto analysis and visualisation. 

Population will also be imported for each country as to standardise analysis to per capita findings. 
Ireland population: https://fred.stlouisfed.org/series/POPTOTIEA647NWDB

In [3]:
#import dataset
europe = pd.read_csv("data\Production_Crops_Livestock_E_Europe_NOFLAG.csv")

europe.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019,Y2020
0,3,Albania,515,Apples,5312,Area harvested,ha,NaN,NaN,NaN,...,3450.0,3719.0,3838.0,3863.0,4008.0,4230.0,4346.0,4294.0,4407.0,4420.0
1,3,Albania,515,Apples,5419,Yield,hg/ha,NaN,NaN,NaN,...,185507.0,191718.0,197316.0,212426.0,228882.0,240028.0,221671.0,252387.0,240374.0,231147.0
2,3,Albania,515,Apples,5510,Production,tonnes,10004.0,8039.0,7931.0,...,64000.0,71300.0,75730.0,82060.0,91736.0,101532.0,96338.0,108375.0,105933.0,102167.0
3,3,Albania,526,Apricots,5312,Area harvested,ha,NaN,NaN,NaN,...,300.0,301.0,315.0,320.0,331.0,326.0,326.0,337.0,341.0,346.0
4,3,Albania,526,Apricots,5419,Yield,hg/ha,NaN,NaN,NaN,...,130000.0,147176.0,139683.0,129375.0,152417.0,159325.0,154601.0,152493.0,142962.0,148642.0

In [4]:
#import dataset
europe_trade = pd.read_csv("data\Trade_CropsLivestock_E_Europe_NOFLAG.csv")

europe_trade.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019,Y2020
0,3,Albania,862,Alfalfa meal and pellets,5610,Import Quantity,tonnes,NaN,NaN,NaN,...,290.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN,5.0,NaN
1,3,Albania,862,Alfalfa meal and pellets,5622,Import Value,1000 US$,NaN,NaN,NaN,...,89.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN,0.0,NaN
2,3,Albania,862,Alfalfa meal and pellets,5910,Export Quantity,tonnes,NaN,NaN,NaN,...,0.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,3,Albania,862,Alfalfa meal and pellets,5922,Export Value,1000 US$,NaN,NaN,NaN,...,0.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,3,Albania,231,Almonds shelled,5610,Import Quantity,tonnes,NaN,NaN,NaN,...,180.0,144.0,126.0,32.0,133.0,129.0,59.0,85.0,512.0,367.0

In [5]:
#import dataset
americas = pd.read_csv("data\Production_Crops_Livestock_E_Americas_NOFLAG.csv")

americas.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019,Y2020
0,8,Antigua and Barbuda,1107,Asses,5111,Stocks,Head,2300.0,2300.0,2300.0,...,1700.0,1700.0,1700.0,1700.0,1703.0,1707.0,1719.0,1719.0,1723.0,1726.0
1,8,Antigua and Barbuda,486,Bananas,5312,Area harvested,ha,NaN,NaN,NaN,...,28.0,35.0,32.0,35.0,37.0,41.0,44.0,48.0,52.0,11.0
2,8,Antigua and Barbuda,486,Bananas,5419,Yield,hg/ha,NaN,NaN,NaN,...,85357.0,71429.0,79688.0,74000.0,71081.0,56341.0,46364.0,37292.0,28846.0,4545.0
3,8,Antigua and Barbuda,486,Bananas,5510,Production,tonnes,NaN,NaN,NaN,...,239.0,250.0,255.0,259.0,263.0,231.0,204.0,179.0,150.0,5.0
4,8,Antigua and Barbuda,414,"Beans, green",5312,Area harvested,ha,1.0,1.0,2.0,...,24.0,25.0,25.0,25.0,25.0,25.0,26.0,26.0,26.0,26.0

In [6]:
#import dataset
americas_trade = pd.read_csv("data\Trade_CropsLivestock_E_Americas_NOFLAG.csv")

americas_trade.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019,Y2020
0,8,Antigua and Barbuda,862,Alfalfa meal and pellets,5610,Import Quantity,tonnes,NaN,NaN,NaN,...,NaN,NaN,NaN,0.0,0.0,0.0,0.0,0.0,0.0,NaN
1,8,Antigua and Barbuda,862,Alfalfa meal and pellets,5622,Import Value,1000 US$,NaN,NaN,NaN,...,NaN,NaN,NaN,1.0,1.0,0.0,0.0,0.0,0.0,NaN
2,8,Antigua and Barbuda,231,Almonds shelled,5610,Import Quantity,tonnes,NaN,NaN,NaN,...,NaN,36.0,8.0,12.0,16.0,12.0,16.0,16.0,13.0,1.0
3,8,Antigua and Barbuda,231,Almonds shelled,5622,Import Value,1000 US$,NaN,NaN,NaN,...,NaN,145.0,37.0,47.0,46.0,38.0,54.0,59.0,44.0,6.0
4,8,Antigua and Barbuda,231,Almonds shelled,5910,Export Quantity,tonnes,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN

In [7]:
#import dataset
oceania = pd.read_csv("data\Production_Crops_Livestock_E_Oceania_NOFLAG.csv")

oceania.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019,Y2020
0,10,Australia,221,"Almonds, with shell",5312,Area harvested,ha,NaN,NaN,NaN,...,25666.0,26058.0,28586.0,28060.0,28190.0,28553.0,29282.0,31361.0,37903.0,39301.0
1,10,Australia,221,"Almonds, with shell",5419,Yield,hg/ha,NaN,NaN,NaN,...,32300.0,41907.0,56531.0,54337.0,55090.0,61170.0,63513.0,55164.0,55932.0,56458.0
2,10,Australia,221,"Almonds, with shell",5510,Production,tonnes,NaN,NaN,NaN,...,82900.0,109200.0,161600.0,152470.0,155300.0,174660.0,185980.0,173000.0,212000.0,221886.0
3,10,Australia,711,"Anise, badian, fennel, coriander",5312,Area harvested,ha,NaN,NaN,NaN,...,914.0,1015.0,1040.0,989.0,989.0,1006.0,987.0,994.0,996.0,992.0
4,10,Australia,711,"Anise, badian, fennel, coriander",5419,Yield,hg/ha,NaN,NaN,NaN,...,11368.0,11488.0,11548.0,11587.0,11608.0,11581.0,11581.0,11590.0,11576.0,11593.0

In [8]:
#import dataset
oceania_trade = pd.read_csv("data\Trade_CropsLivestock_E_Oceania_NOFLAG.csv")

oceania_trade.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019,Y2020
0,10,Australia,862,Alfalfa meal and pellets,5610,Import Quantity,tonnes,0.0,0.0,0.0,...,12.0,9.0,0.0,1.0,13.0,59.0,109.0,657.0,1003.0,1.0
1,10,Australia,862,Alfalfa meal and pellets,5622,Import Value,1000 US$,0.0,0.0,0.0,...,34.0,25.0,0.0,4.0,18.0,55.0,149.0,363.0,497.0,9.0
2,10,Australia,862,Alfalfa meal and pellets,5910,Export Quantity,tonnes,0.0,0.0,0.0,...,85992.0,77026.0,73652.0,97312.0,84691.0,81045.0,72941.0,52186.0,50680.0,40056.0
3,10,Australia,862,Alfalfa meal and pellets,5922,Export Value,1000 US$,0.0,0.0,0.0,...,25292.0,24082.0,23972.0,38488.0,27409.0,26811.0,20611.0,16656.0,16107.0,12946.0
4,10,Australia,231,Almonds shelled,5610,Import Quantity,tonnes,0.0,0.0,0.0,...,1164.0,2309.0,2515.0,2056.0,1904.0,2314.0,3061.0,3657.0,2784.0,2436.0

In [9]:
#import dataset
ireland_pop = pd.read_csv("data\irelandpop.csv")

columns = [ 'Date', 'Population_Ireland']
ireland_pop.columns = columns

ireland_pop.head()

         Date  Population_Ireland
0  1960-01-01           2828600.0
1  1961-01-01           2824400.0
2  1962-01-01           2836050.0
3  1963-01-01           2852650.0
4  1964-01-01           2866550.0

In [10]:
#import dataset
germany_pop = pd.read_csv("data\germanypop.csv")

columns = [ 'Date', 'Population_Germany']
germany_pop.columns = columns

germany_pop.head()

         Date  Population_Germany
0  1960-01-01          72814900.0
1  1961-01-01          73377632.0
2  1962-01-01          74025784.0
3  1963-01-01          74714353.0
4  1964-01-01          75318337.0

In [11]:
#import dataset
us_pop = pd.read_csv("data\\americapop.csv")

columns = ['Date', 'Population_US']
us_pop.columns = columns

us_pop.head()

         Date  Population_US
0  1960-01-01      180671000
1  1961-01-01      183691000
2  1962-01-01      186538000
3  1963-01-01      189242000
4  1964-01-01      191889000

In [12]:
#import dataset
aus_pop = pd.read_csv("data\\australiapop.csv")

columns = [ 'Date', 'Population_Australia']
aus_pop.columns = columns

aus_pop.head()

         Date  Population_Australia
0  1960-01-01            10276477.0
1  1961-01-01            10483000.0
2  1962-01-01            10742000.0
3  1963-01-01            10950000.0
4  1964-01-01            11167000.0

## Europe Production Dataset

The European Prouction Dataset is taken from faostat and contains annual data on all crops and animal products producted in  Europe from 1961-2020, measured in tonnes. It also contains information on livestock numbers, yields, areas havested and slaughtering numbers.

Unit Measurements:

    Production = tonnes
    Area harvested = ha
    Yield =	hg/ha
    Stocks = head 
    Slaughter = head
    Yields/ Carcass Weight = 0.1g/An, hg/An
    Milking Animals = head
    Laying = head
    Prod Popultn (bees/honey) = number

"Crop statistics are recorded for 173 products, covering the following categories: Crops Primary, Fibre Crops Primary, Cereals, Coarse Grain, Citrus Fruit, Fruit, Jute Jute-like Fibres, Oilcakes Equivalent, Oil crops Primary, Pulses, Roots and Tubers, Treenuts and Vegetables and Melons. Data are expressed in terms of area harvested, production quantity and yield. The objective is to comprehensively cover production of all primary crops for all countries and regions in the world. Area and production data on cereals relate to crops harvested for dry grain only. Cereal crops harvested for hay or harvested green for food, feed or silage or used for grazing are therefore excluded. Area data relate to harvested area. Some countries report sown or cultivated area only." https://www.fao.org/faostat/en/#data/QCL

In [13]:
#drop columns not required for analysis
to_drop = ['Area Code','Item Code','Element Code']
europe.drop(to_drop, inplace=True, axis=1)

### Melt Data

The current dataset is difficult to read as it has lots of columns for the different years of data. This dataset can be reshaped using the melt() function

In [14]:
# melt new dataframe in order to visualise data by street 
europe_melt = pd.melt(europe, id_vars=[ 'Area', 'Item', 'Element', 'Unit'])

# rename columns 
columns = [ 'Country', 'Crop_Livestock', 'Element', 'Unit', 'Year', 'Value']
europe_melt.columns = columns

#remove Y from year
europe_melt['Year'] = europe_melt['Year'].str[1:]

#set Year to datetime dtype
#europe_melt['Year']= pd.to_datetime(europe_melt['Year'])

europe_melt.head()

   Country Crop_Livestock         Element    Unit  Year    Value
0  Albania         Apples  Area harvested      ha  1961      NaN
1  Albania         Apples           Yield   hg/ha  1961      NaN
2  Albania         Apples      Production  tonnes  1961  10004.0
3  Albania       Apricots  Area harvested      ha  1961      NaN
4  Albania       Apricots           Yield   hg/ha  1961      NaN

In [15]:
# dataframe shape, number of rows/ columns 
europe_melt.shape

(959580, 6)

In [16]:
europe_melt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 959580 entries, 0 to 959579
Data columns (total 6 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Country         959580 non-null  object
 1   Crop_Livestock  959580 non-null  object
 2   Element         959580 non-null  object
 3   Unit            959580 non-null  object
 4   Year            959580 non-null  object
 5   Value           544700 non-null  float64
dtypes: float64(1), object(5)
memory usage: 43.9+ MB

### Missing Values

Missing values and 0 values reflect that there was no production/ harvest/ yield etc. in a given year for a given country for a given crop/livestock. As there is no difference in significance betwee 0 or NaN vlaues, these can be dropped. There is no need to interpolate for this analysis as it is important to see what was actually produced to ensure the integity of the analysis.

In [17]:
# number of missing values 
europe_melt.isnull().sum()

Country                0
Crop_Livestock         0
Element                0
Unit                   0
Year                   0
Value             414880
dtype: int64

In [18]:
#check the amount of 0's in each column
europe_melt_sparse = (europe_melt == 0).sum()
europe_melt_sparse

Country              0
Crop_Livestock       0
Element              0
Unit                 0
Year                 0
Value             8086
dtype: int64

In [19]:
# drop all rows with NaN and 0 values

# first will replace 0 values with NaNs  
europe_melt.replace(to_replace = 0, value = np.nan, inplace=True)

# row = 0, column = 1
europe_df = europe_melt.dropna(axis=0)

# check if we have any NaN values in our dataset
europe_df.isnull().values.any()

False

In [20]:
europe_df.shape

(536614, 6)

## Ireland Production Datasets

In [21]:
# create irish dataset
ireland_prod_df = europe_df.loc[europe_df['Country']=='Ireland']

# irish production dataset - all products (crop, meat, livestock)
ireland_prod = ireland_prod_df.loc[ireland_prod_df['Element']=='Production']

# irish production meat products
ireland_meat_prod = ireland_prod.loc[ireland_prod['Crop_Livestock'].str.contains('meat', case=False)]
ireland_meat_prod.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)

# irish production dairy products
ireland_dairy_prod = ireland_prod.loc[ireland_prod['Crop_Livestock'].str.contains('milk', case=False)]
ireland_dairy_prod.rename(columns={'Crop_Livestock': 'Dairy Product'}, inplace=True)

# irish production crops
ireland_crop_prod = ireland_prod.loc[ireland_prod['Crop_Livestock'].str.contains('meat', case=False) == False]
ireland_crop_prod = ireland_crop_prod.loc[ireland_crop_prod['Crop_Livestock'].str.contains('milk', case=False) == False]
ireland_crop_prod.rename(columns={'Crop_Livestock': 'Crop'}, inplace=True)


ireland_meat_prod.head()
ireland_dairy_prod.head()
ireland_crop_prod.head()

      Country                    Meat Type     Element    Unit  Year     Value
6692  Ireland                     Meat nes  Production  tonnes  1961    5000.0
6694  Ireland                 Meat, cattle  Production  tonnes  1961  144539.0
6697  Ireland                Meat, chicken  Production  tonnes  1961   10000.0
6700  Ireland                   Meat, duck  Production  tonnes  1961    1400.0
6705  Ireland  Meat, goose and guinea fowl  Production  tonnes  1961    1000.0

      Country           Dairy Product     Element    Unit  Year      Value
6600  Ireland        Butter, cow milk  Production  tonnes  1961    61300.0
6615  Ireland  Cheese, whole cow milk  Production  tonnes  1961     6000.0
6721  Ireland       Milk, skimmed cow  Production  tonnes  1961  1423066.0
6722  Ireland     Milk, skimmed dried  Production  tonnes  1961     6000.0
6723  Ireland   Milk, whole condensed  Production  tonnes  1961      330.0

,Country,Crop,Element,Unit,Year,Value
6573,Ireland,Apples,Production,tonnes,1961,29000.0
6583,Ireland,Barley,Production,tonnes,1961,515400.0
6590,Ireland,Beer of barley,Production,tonnes,1961,363000.0
6593,Ireland,Berries nes,Production,tonnes,1961,1000.0
6603,Ireland,Cabbages and other brassicas,Production,tonnes,1961,25000.0

 ## Germany Production Datasets

In [22]:
# create german dataset
germany_prod_df = europe_df.loc[europe_df['Country']=='Germany']

# german production dataset - all products (crop, meat, livestock)
germany_prod = germany_prod_df.loc[germany_prod_df['Element']=='Production']

# german production meat products
germany_meat_prod = germany_prod.loc[germany_prod['Crop_Livestock'].str.contains('meat', case=False)]
germany_meat_prod.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)

# german production dairy products
germany_dairy_prod = germany_prod.loc[germany_prod['Crop_Livestock'].str.contains('milk', case=False)]
germany_dairy_prod.rename(columns={'Crop_Livestock': 'Dairy Product'}, inplace=True)

# german production crops
germany_crop_prod = germany_prod.loc[germany_prod['Crop_Livestock'].str.contains('meat', case=False) == False]
germany_crop_prod = germany_crop_prod.loc[germany_crop_prod['Crop_Livestock'].str.contains('milk', case=False) == False]
germany_crop_prod.rename(columns={'Crop_Livestock': 'Crop'}, inplace=True)

germany_meat_prod.head()
germany_dairy_prod.head()
germany_crop_prod.head()

      Country      Meat Type     Element    Unit  Year      Value
5262  Germany   Meat, cattle  Production  tonnes  1961  1296200.0
5265  Germany  Meat, chicken  Production  tonnes  1961   150100.0
5268  Germany     Meat, duck  Production  tonnes  1961    10080.0
5270  Germany     Meat, game  Production  tonnes  1961    17000.0
5272  Germany     Meat, goat  Production  tonnes  1961     5648.0

      Country             Dairy Product     Element    Unit  Year       Value
5139  Germany          Butter, cow milk  Production  tonnes  1961    633900.0
5150  Germany         Cheese, goat milk  Production  tonnes  1961     39600.0
5151  Germany  Cheese, skimmed cow milk  Production  tonnes  1961    175300.0
5152  Germany    Cheese, whole cow milk  Production  tonnes  1961    204700.0
5292  Germany         Milk, skimmed cow  Production  tonnes  1961  14356399.0

      Country        Crop     Element    Unit  Year      Value
5106  Germany      Apples  Production  tonnes  1961   851000.0
5109  Germany    Apricots  Production  tonnes  1961     2900.0
5112  Germany   Asparagus  Production  tonnes  1961    16300.0
5119  Germany      Barley  Production  tonnes  1961  3669020.0
5122  Germany  Beans, dry  Production  tonnes  1961    12693.0

In [ ]:
# Rename 2015 Columns
# dcc_2015_ff.rename(columns={' O_Connell_St_Outside_Clerys': 'OConnell_St_Clerys'}, inplace=True)

## European Trade Dataset

The European Trade Dataset is taken from faostat and contains annual data on all crop/ livestock/ animal product Imports and Exports in Europe from 1961-2020, measured in tonnes and heads. It also contains information on Import and Export values in $1000US.

Import/ Export Quantity Unit Measurements:

    Crops = tonnes
    Livestock = head
    Dairy Products = tonnes
    Meat animal Product = tonnes 

"The food and agricultural trade dataset is collected, processed and disseminated by FAO according to the standard International Merchandise Trade Statistics (IMTS) Methodology. The data is mainly provided by UNSD, Eurostat, and other national authorities as needed. This source data is checked for outliers, trade partner data is used for non-reporting countries or missing cells, and data on food aid is added to take into account total cross-border trade flows."  https://www.fao.org/faostat/en/#data/TCL

In [23]:
#drop columns not required for analysis
europe_trade.drop(to_drop, inplace=True, axis=1)

### Melt Data

In [24]:
# melt new dataframe in order to visualise data by street 
europe_trade_melt = pd.melt(europe_trade, id_vars=[ 'Area', 'Item', 'Element', 'Unit'])

# rename columns 
columns = [ 'Country', 'Crop_Livestock', 'Element', 'Unit', 'Year', 'Value']
europe_trade_melt.columns = columns

#remove Y from year
europe_trade_melt['Year'] = europe_trade_melt['Year'].str[1:]

#set Year to datetime dtype
#europe_melt['Year']= pd.to_datetime(europe_melt['Year'])

europe_trade_melt.head()

   Country            Crop_Livestock          Element      Unit  Year  Value
0  Albania  Alfalfa meal and pellets  Import Quantity    tonnes  1961    NaN
1  Albania  Alfalfa meal and pellets     Import Value  1000 US$  1961    NaN
2  Albania  Alfalfa meal and pellets  Export Quantity    tonnes  1961    NaN
3  Albania  Alfalfa meal and pellets     Export Value  1000 US$  1961    NaN
4  Albania           Almonds shelled  Import Quantity    tonnes  1961    NaN

In [25]:
# dataframe shape, number of rows/ columns 
europe_trade_melt.shape

(4092480, 6)

In [27]:
europe_trade_melt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4092480 entries, 0 to 4092479
Data columns (total 6 columns):
 #   Column          Dtype
---  ------          -----
 0   Country         object
 1   Crop_Livestock  object
 2   Element         object
 3   Unit            object
 4   Year            object
 5   Value           float64
dtypes: float64(1), object(5)
memory usage: 187.3+ MB

### Missing Values

In [28]:
# number of missing values 
europe_trade_melt.isnull().sum()

Country                 0
Crop_Livestock          0
Element                 0
Unit                    0
Year                    0
Value             1547041
dtype: int64

In [29]:
#check the amount of 0's in each column
europe_trade_melt_sparse = (europe_trade_melt == 0).sum()
europe_trade_melt_sparse

Country                0
Crop_Livestock         0
Element                0
Unit                   0
Year                   0
Value             496259
dtype: int64

In [30]:
# drop all rows with NaN and 0 values

# first will replace 0 values with NaNs  
europe_trade_melt.replace(to_replace = 0, value = np.nan, inplace=True)

# row = 0, column = 1
europe_trade_df = europe_trade_melt.dropna(axis=0)

# check if we have any NaN values in our dataset
europe_trade_df.isnull().values.any()

False

In [31]:
europe_trade_df.shape

(2049180, 6)

## Ireland Trade Datasets

In [32]:
# create irish dataset
ireland_trade = europe_trade_df.loc[europe_trade_df['Country']=='Ireland']

# irish import/ export datasets - all products (crop, meat, livestock)
ireland_imports = ireland_trade.loc[ireland_trade['Element']=='Import Quantity']
ireland_exports = ireland_trade.loc[ireland_trade['Element']=='Export Quantity']

# import/ export livestock
ireland_livestock_imports = ireland_imports.loc[ireland_imports['Unit'].str.contains('head', case=False)]
ireland_livestock_exports = ireland_exports.loc[ireland_exports['Unit'].str.contains('head', case=False)]
ireland_livestock_imports.rename(columns={'Crop_Livestock': 'Animal Type'}, inplace=True)
ireland_livestock_exports.rename(columns={'Crop_Livestock': 'Animal Type'}, inplace=True)

# import/ export meat products
ireland_meat_imports = ireland_imports.loc[ireland_imports['Crop_Livestock'].str.contains('meat', case=False)]
ireland_meat_exports = ireland_exports.loc[ireland_exports['Crop_Livestock'].str.contains('meat', case=False)]
ireland_meat_imports.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)
ireland_meat_exports.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)

# import/ export dairy products
ireland_dairy_imports = ireland_imports.loc[ireland_imports['Crop_Livestock'].str.contains('milk', case=False)]
ireland_dairy_exports = ireland_exports.loc[ireland_exports['Crop_Livestock'].str.contains('milk', case=False)]
ireland_dairy_imports.rename(columns={'Crop_Livestock': 'Dairy Type'}, inplace=True)
ireland_dairy_exports.rename(columns={'Crop_Livestock': 'Dairy Type'}, inplace=True)

# import/ export crops
ire_imports_tonnes = ireland_imports.loc[ireland_imports['Unit'].str.contains('tonne', case=False)]
ire_exports_tonnes = ireland_exports.loc[ireland_exports['Unit'].str.contains('tonne', case=False)]
ireland_crop_imports = ire_imports_tonnes.loc[ire_imports_tonnes['Crop_Livestock'].str.contains('meat', case=False) == False]
ireland_crop_exports = ire_exports_tonnes.loc[ire_exports_tonnes['Crop_Livestock'].str.contains('meat', case=False) == False]
ireland_crop_imports.rename(columns={'Crop_Livestock': 'Crop Type'}, inplace=True)
ireland_crop_exports.rename(columns={'Crop_Livestock': 'Crop Type'}, inplace=True)

ireland_livestock_imports.head()
ireland_meat_imports.head()
ireland_dairy_imports.head()
ireland_crop_imports.head()

ireland_livestock_exports.head()
ireland_meat_exports.head()
ireland_dairy_exports.head()
ireland_crop_exports.head()

       Country Animal Type          Element       Unit  Year     Value
28659  Ireland      Cattle  Import Quantity       Head  1961  159400.0
28705  Ireland    Chickens  Import Quantity  1000 Head  1961    2010.0
29082  Ireland      Horses  Import Quantity       Head  1961    1042.0
29556  Ireland        Pigs  Import Quantity       Head  1961    3300.0
29670  Ireland       Sheep  Import Quantity       Head  1961  367500.0

,Country,Meat Type,Element,Unit,Year,Value
29229,Ireland,"Meal, meat",Import Quantity,tonnes,1961,130.0
29239,Ireland,"Meat, beef, preparations",Import Quantity,tonnes,1961,34.0
29243,Ireland,"Meat, cattle",Import Quantity,tonnes,1961,11.0
29937,Ireland,Bovine Meat,Import Quantity,tonnes,1961,55.0
97437,Ireland,"Meal, meat",Import Quantity,tonnes,1962,1780.0

       Country              Dairy Type          Element    Unit  Year  Value
28583  Ireland        Butter, cow milk  Import Quantity  tonnes  1961   41.0
28684  Ireland  Cheese, whole cow milk  Import Quantity  tonnes  1961  140.0
29319  Ireland       Milk, skimmed cow  Import Quantity  tonnes  1961   45.0
29331  Ireland       Milk, whole dried  Import Quantity  tonnes  1961   23.0
29335  Ireland  Milk, whole evaporated  Import Quantity  tonnes  1961    4.0

       Country        Crop Type          Element    Unit  Year    Value
28451  Ireland  Almonds shelled  Import Quantity  tonnes  1961    493.0
28469  Ireland           Apples  Import Quantity  tonnes  1961   9085.0
28505  Ireland          Bananas  Import Quantity  tonnes  1961  11180.0
28509  Ireland           Barley  Import Quantity  tonnes  1961   4544.0
28513  Ireland  Barley, pearled  Import Quantity  tonnes  1961   2177.0

       Country Animal Type          Element       Unit  Year     Value
28495  Ireland       Asses  Export Quantity       Head  1961    1362.0
28662  Ireland      Cattle  Export Quantity       Head  1961  722400.0
28708  Ireland    Chickens  Export Quantity  1000 Head  1961    1490.0
29085  Ireland      Horses  Export Quantity       Head  1961   18329.0
29559  Ireland        Pigs  Export Quantity       Head  1961    2500.0

,Country,Meat Type,Element,Unit,Year,Value
29231,Ireland,"Meal, meat",Export Quantity,tonnes,1961,460.0
29235,Ireland,Meat nes,Export Quantity,tonnes,1961,440.0
29237,Ireland,"Meat, beef and veal sausages",Export Quantity,tonnes,1961,388.0
29241,Ireland,"Meat, beef, preparations",Export Quantity,tonnes,1961,8099.0
29245,Ireland,"Meat, cattle",Export Quantity,tonnes,1961,38746.0

       Country              Dairy Type          Element    Unit  Year    Value
28585  Ireland        Butter, cow milk  Export Quantity  tonnes  1961  15399.0
28686  Ireland  Cheese, whole cow milk  Export Quantity  tonnes  1961   2370.0
29325  Ireland     Milk, skimmed dried  Export Quantity  tonnes  1961   6199.0
29329  Ireland   Milk, whole condensed  Export Quantity  tonnes  1961    325.0
29333  Ireland       Milk, whole dried  Export Quantity  tonnes  1961   4772.0

       Country       Crop Type          Element    Unit  Year     Value
28471  Ireland          Apples  Export Quantity  tonnes  1961      24.0
28503  Ireland   Bacon and ham  Export Quantity  tonnes  1961   28761.0
28511  Ireland          Barley  Export Quantity  tonnes  1961    1755.0
28529  Ireland  Beer of barley  Export Quantity  tonnes  1961  202407.0
28537  Ireland       Beet pulp  Export Quantity  tonnes  1961    4169.0

## Germany Trade Datasets

In [33]:
# create german dataset
germany_trade = europe_trade_df.loc[europe_trade_df['Country']=='Germany']

# german import/ export datasets - all products (crop, meat, livestock)
germany_imports = germany_trade.loc[germany_trade['Element']=='Import Quantity']
germany_exports = germany_trade.loc[germany_trade['Element']=='Export Quantity']

# import/ export livestock
germany_livestock_imports = germany_imports.loc[germany_imports['Unit'].str.contains('head', case=False)]
germany_livestock_exports = germany_exports.loc[germany_exports['Unit'].str.contains('head', case=False)]
germany_livestock_imports.rename(columns={'Crop_Livestock': 'Animal Type'}, inplace=True)
germany_livestock_exports.rename(columns={'Crop_Livestock': 'Animal Type'}, inplace=True)

# import/ export meat products
germany_meat_imports = germany_imports.loc[germany_imports['Crop_Livestock'].str.contains('meat', case=False)]
germany_meat_exports = germany_exports.loc[germany_exports['Crop_Livestock'].str.contains('meat', case=False)]
germany_meat_imports.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)
germany_meat_exports.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)

# import/ export dairy products
germany_dairy_imports = germany_imports.loc[germany_imports['Crop_Livestock'].str.contains('milk', case=False)]
germany_dairy_exports = germany_exports.loc[germany_exports['Crop_Livestock'].str.contains('milk', case=False)]
germany_dairy_imports.rename(columns={'Crop_Livestock': 'Dairy Type'}, inplace=True)
germany_dairy_exports.rename(columns={'Crop_Livestock': 'Dairy Type'}, inplace=True)

# import/ export crops
ger_imports_tonnes = germany_imports.loc[germany_imports['Unit'].str.contains('tonne', case=False)]
ger_exports_tonnes = germany_exports.loc[germany_exports['Unit'].str.contains('tonne', case=False)]
germany_crop_imports = ger_imports_tonnes.loc[ger_imports_tonnes['Crop_Livestock'].str.contains('meat', case=False) == False]
germany_crop_exports = ger_exports_tonnes.loc[ger_exports_tonnes['Crop_Livestock'].str.contains('meat', case=False) == False]
germany_crop_imports.rename(columns={'Crop_Livestock': 'Crop Type'}, inplace=True)
germany_crop_exports.rename(columns={'Crop_Livestock': 'Crop Type'}, inplace=True)

germany_livestock_imports.head()
germany_meat_imports.head()
germany_dairy_imports.head()
germany_crop_imports.head()

germany_livestock_exports.head()
germany_meat_exports.head()
germany_dairy_exports.head()
germany_crop_exports.head()

       Country Animal Type          Element       Unit  Year     Value
22308  Germany       Asses  Import Quantity       Head  1961      25.0
22486  Germany      Cattle  Import Quantity       Head  1961  449000.0
22532  Germany    Chickens  Import Quantity  1000 Head  1961    2622.0
22932  Germany      Horses  Import Quantity       Head  1961    2946.0
23414  Germany        Pigs  Import Quantity       Head  1961  775446.0

,Country,Meat Type,Element,Unit,Year,Value
23083,Germany,"Meal, meat",Import Quantity,tonnes,1961,5760.0
23087,Germany,Meat nes,Import Quantity,tonnes,1961,520.0
23091,Germany,"Meat, beef, preparations",Import Quantity,tonnes,1961,4950.0
23095,Germany,"Meat, cattle",Import Quantity,tonnes,1961,165858.0
23103,Germany,"Meat, chicken",Import Quantity,tonnes,1961,169900.0

,Country,Dairy Type,Element,Unit,Year,Value
22407,Germany,"Butter, cow milk",Import Quantity,tonnes,1961,28077.0
22511,Germany,"Cheese, whole cow milk",Import Quantity,tonnes,1961,129849.0
23175,Germany,"Milk, skimmed dried",Import Quantity,tonnes,1961,7035.0
23183,Germany,"Milk, whole dried",Import Quantity,tonnes,1961,11137.0
23187,Germany,"Milk, whole evaporated",Import Quantity,tonnes,1961,6340.0

,Country,Crop Type,Element,Unit,Year,Value
22263,Germany,Alfalfa meal and pellets,Import Quantity,tonnes,1961,33778.0
22267,Germany,Almonds shelled,Import Quantity,tonnes,1961,23384.0
22279,Germany,"Anise, badian, fennel, coriander",Import Quantity,tonnes,1961,3536.0
22283,Germany,Apples,Import Quantity,tonnes,1961,599555.0
22287,Germany,Apricots,Import Quantity,tonnes,1961,21201.0

       Country Animal Type          Element       Unit  Year    Value
22311  Germany       Asses  Export Quantity       Head  1961     11.0
22489  Germany      Cattle  Export Quantity       Head  1961  11400.0
22535  Germany    Chickens  Export Quantity  1000 Head  1961    244.0
22867  Germany       Goats  Export Quantity       Head  1961     31.0
22935  Germany      Horses  Export Quantity       Head  1961  30861.0

,Country,Meat Type,Element,Unit,Year,Value
23085,Germany,"Meal, meat",Export Quantity,tonnes,1961,2520.0
23093,Germany,"Meat, beef, preparations",Export Quantity,tonnes,1961,1600.0
23097,Germany,"Meat, cattle",Export Quantity,tonnes,1961,10737.0
23105,Germany,"Meat, chicken",Export Quantity,tonnes,1961,1110.0
23109,Germany,"Meat, chicken, canned",Export Quantity,tonnes,1961,88.0

       Country              Dairy Type          Element    Unit  Year    Value
22409  Germany        Butter, cow milk  Export Quantity  tonnes  1961      1.0
22513  Germany  Cheese, whole cow milk  Export Quantity  tonnes  1961  11836.0
23177  Germany     Milk, skimmed dried  Export Quantity  tonnes  1961   2416.0
23185  Germany       Milk, whole dried  Export Quantity  tonnes  1961    150.0
23189  Germany  Milk, whole evaporated  Export Quantity  tonnes  1961    150.0

,Country,Crop Type,Element,Unit,Year,Value
22269,Germany,Almonds shelled,Export Quantity,tonnes,1961,185.0
22281,Germany,"Anise, badian, fennel, coriander",Export Quantity,tonnes,1961,61.0
22285,Germany,Apples,Export Quantity,tonnes,1961,730.0
22319,Germany,Bacon and ham,Export Quantity,tonnes,1961,144.0
22327,Germany,Bananas,Export Quantity,tonnes,1961,2960.0

## Oceania Production Dataset

The Oceania Prouction Dataset is taken from faostat and contains annual data on all crops and animal products producted throughout the Oceania region from 1961-2020, measured in tonnes. It also contains information on livestock numbers, yields, areas havested and slaughtering numbers.

Unit Measurements:

    Production = tonnes
    Area harvested = ha
    Yield =	hg/ha
    Stocks = head 
    Slaughter = head
    Yields/ Carcass Weight = 0.1g/An, hg/An
    Milking Animals = head
    Laying = head
    Prod Popultn (bees/honey) = number

"Crop statistics are recorded for 173 products, covering the following categories: Crops Primary, Fibre Crops Primary, Cereals, Coarse Grain, Citrus Fruit, Fruit, Jute Jute-like Fibres, Oilcakes Equivalent, Oil crops Primary, Pulses, Roots and Tubers, Treenuts and Vegetables and Melons. Data are expressed in terms of area harvested, production quantity and yield. The objective is to comprehensively cover production of all primary crops for all countries and regions in the world. Area and production data on cereals relate to crops harvested for dry grain only. Cereal crops harvested for hay or harvested green for food, feed or silage or used for grazing are therefore excluded. Area data relate to harvested area. Some countries report sown or cultivated area only." https://www.fao.org/faostat/en/#data/QCL

In [34]:
#drop columns not required for analysis
to_drop = ['Area Code','Item Code','Element Code']
oceania.drop(to_drop, inplace=True, axis=1)

### Melt Data

In [59]:
# melt new dataframe in order to visualise data by street 
oceania_melt = pd.melt(oceania, id_vars=[ 'Area', 'Item', 'Element', 'Unit'])

# rename columns 
columns = [ 'Country', 'Crop_Livestock', 'Element', 'Unit', 'Year', 'Value']
oceania_melt.columns = columns

#remove Y from year
oceania_melt['Year'] = europe_melt['Year'].str[1:]

#set Year to datetime dtype
#europe_melt['Year']= pd.to_datetime(europe_melt['Year'])

oceania_melt.head()

,Country,Crop_Livestock,Element,Unit,Year,Value
0,Australia,"Almonds, with shell",Area harvested,ha,961,NaN
1,Australia,"Almonds, with shell",Yield,hg/ha,961,NaN
2,Australia,"Almonds, with shell",Production,tonnes,961,NaN
3,Australia,"Anise, badian, fennel, coriander",Area harvested,ha,961,NaN
4,Australia,"Anise, badian, fennel, coriander",Yield,hg/ha,961,NaN

In [36]:
# dataframe shape, number of rows/ columns 
oceania_melt.shape

(161100, 6)

In [37]:
oceania_melt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 161100 entries, 0 to 161099
Data columns (total 6 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Country         161100 non-null  object
 1   Crop_Livestock  161100 non-null  object
 2   Element         161100 non-null  object
 3   Unit            161100 non-null  object
 4   Year            161100 non-null  object
 5   Value           139641 non-null  float64
dtypes: float64(1), object(5)
memory usage: 7.4+ MB

### Missing Values

In [38]:
# number of missing values 
oceania_melt.isnull().sum()

Country               0
Crop_Livestock        0
Element               0
Unit                  0
Year                  0
Value             21459
dtype: int64

In [39]:
#check the amount of 0's in each column
oceania_melt_sparse = (oceania_melt == 0).sum()
oceania_melt_sparse

Country              0
Crop_Livestock       0
Element              0
Unit                 0
Year                 0
Value             1226
dtype: int64

In [40]:
# drop all rows with NaN and 0 values

# first will replace 0 values with NaNs  
oceania_melt.replace(to_replace = 0, value = np.nan, inplace=True)

# row = 0, column = 1
oceania_df = oceania_melt.dropna(axis=0)

# check if we have any NaN values in our dataset
oceania_df.isnull().values.any()

False

In [41]:
oceania_df.shape

(138415, 6)

In [42]:
oceania_df.head()

      Country Crop_Livestock         Element    Unit Year     Value
6   Australia         Apples  Area harvested      ha  961   26656.0
7   Australia         Apples           Yield   hg/ha  961  110682.0
8   Australia         Apples      Production  tonnes  961  295034.0
9   Australia       Apricots  Area harvested      ha  961    3794.0
10  Australia       Apricots           Yield   hg/ha  961  107251.0

## Australia Production Datasets

In [43]:
# create australian dataset
oz_df = oceania_df.loc[oceania_df['Country']=='Australia']

# australian production dataset - all products (crop, meat, livestock)
oz_prod = oz_df.loc[oz_df['Element']=='Production']

# australian production meat products
oz_meat_prod = oz_prod.loc[oz_prod['Crop_Livestock'].str.contains('meat', case=False)]
oz_meat_prod.rename(columns={'Crop_Livestock': 'Meat Type'}, inplace=True)

# australian production dairy products
oz_dairy_prod = oz_prod.loc[oz_prod['Crop_Livestock'].str.contains('milk', case=False)]
oz_dairy_prod.rename(columns={'Crop_Livestock': 'Dairy Product'}, inplace=True)

# australian production crops
oz_crop_prod = oz_prod.loc[oz_prod['Crop_Livestock'].str.contains('meat', case=False) == False]
oz_crop_prod = oz_crop_prod.loc[oz_crop_prod['Crop_Livestock'].str.contains('milk', case=False) == False]
oz_crop_prod.rename(columns={'Crop_Livestock': 'Crop'}, inplace=True)

oz_meat_prod.head()
oz_dairy_prod.head()
oz_crop_prod.head()

       Country      Meat Type     Element    Unit Year     Value
165  Australia   Meat, cattle  Production  tonnes  961  642924.0
168  Australia  Meat, chicken  Production  tonnes  961   46858.0
171  Australia     Meat, duck  Production  tonnes  961     830.0
174  Australia     Meat, goat  Production  tonnes  961     250.0
177  Australia    Meat, horse  Production  tonnes  961   14840.0

       Country            Dairy Product     Element    Unit Year      Value
46   Australia         Butter, cow milk  Production  tonnes  961   182100.0
60   Australia   Cheese, whole cow milk  Production  tonnes  961    47700.0
191  Australia     Milk, dry buttermilk  Production  tonnes  961     7954.0
192  Australia  Milk, skimmed condensed  Production  tonnes  961     5085.0
193  Australia        Milk, skimmed cow  Production  tonnes  961  3698900.0

      Country       Crop     Element    Unit Year     Value
8   Australia     Apples  Production  tonnes  961  295034.0
11  Australia   Apricots  Production  tonnes  961   40691.0
14  Australia  Asparagus  Production  tonnes  961    5262.0
18  Australia   Avocados  Production  tonnes  961     400.0
21  Australia    Bananas  Production  tonnes  961  123863.0

## Oceania Trade Dataset

The Oceania Trade Dataset is taken from faostat and contains annual data on all crop/ livestock/ animal product Imports and Exports throughout the Oceania region from 1961-2020, measured in tonnes and heads. It also contains information on Import and Export values in $1000US.

Import/ Export Quantity Unit Measurements:

    Crops = tonnes
    Livestock = head
    Dairy Products = tonnes
    Meat animal Product = tonnes 

"The food and agricultural trade dataset is collected, processed and disseminated by FAO according to the standard International Merchandise Trade Statistics (IMTS) Methodology. The data is mainly provided by UNSD, Eurostat, and other national authorities as needed. This source data is checked for outliers, trade partner data is used for non-reporting countries or missing cells, and data on food aid is added to take into account total cross-border trade flows."  https://www.fao.org/faostat/en/#data/TCL

In [44]:
#drop columns not required for analysis
oceania_trade.drop(to_drop, inplace=True, axis=1)

### Melt Data

In [45]:
# melt new dataframe in order to visualise data by street 
oceania_trade_melt = pd.melt(oceania_trade, id_vars=[ 'Area', 'Item', 'Element', 'Unit'])

# rename columns 
columns = [ 'Country', 'Crop_Livestock', 'Element', 'Unit', 'Year', 'Value']
oceania_trade_melt.columns = columns

#remove Y from year
oceania_trade_melt['Year'] = oceania_trade_melt['Year'].str[1:]

#set Year to datetime dtype
#europe_melt['Year']= pd.to_datetime(europe_melt['Year'])

oceania_trade_melt.head()

     Country            Crop_Livestock          Element      Unit  Year  Value
0  Australia  Alfalfa meal and pellets  Import Quantity    tonnes  1961    0.0
1  Australia  Alfalfa meal and pellets     Import Value  1000 US$  1961    0.0
2  Australia  Alfalfa meal and pellets  Export Quantity    tonnes  1961    0.0
3  Australia  Alfalfa meal and pellets     Export Value  1000 US$  1961    0.0
4  Australia           Almonds shelled  Import Quantity    tonnes  1961    0.0

In [46]:
# dataframe shape, number of rows/ columns 
oceania_trade_melt.shape

(973620, 6)

In [47]:
oceania_trade_melt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 973620 entries, 0 to 973619
Data columns (total 6 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Country         973620 non-null  object
 1   Crop_Livestock  973620 non-null  object
 2   Element         973620 non-null  object
 3   Unit            973620 non-null  object
 4   Year            973620 non-null  object
 5   Value           548192 non-null  float64
dtypes: float64(1), object(5)
memory usage: 44.6+ MB

### Missing Values

In [48]:
# number of missing values 
oceania_trade_melt.isnull().sum()

Country                0
Crop_Livestock         0
Element                0
Unit                   0
Year                   0
Value             425428
dtype: int64

In [49]:
#check the amount of 0's in each column
oceania_trade_melt_sparse = (oceania_trade_melt == 0).sum()
oceania_trade_melt_sparse

Country                0
Crop_Livestock         0
Element                0
Unit                   0
Year                   0
Value             188846
dtype: int64

In [53]:
# drop all rows with NaN and 0 values

# first will replace 0 values with NaNs  
oceania_trade_melt.replace(to_replace = 0, value = np.nan, inplace=True)

# row = 0, column = 1
oceania_trade_df = oceania_trade_melt.dropna(axis=0)

# check if we have any NaN values in our dataset
oceania_trade_df.isnull().values.any()

False

In [54]:
oceania_trade_df.shape

(359346, 6)

## Australia Trade Datasets

In [58]:
# create australian dataset
oz_trade = oceania_trade_df.loc[oceania_trade_df['Country']=='Australia']

# australian import/ export datasets - all products (crop, meat, livestock)
oz_imports = oz_trade.loc[oz_trade['Element']=='Import Quantity']
oz_exports = oz_trade.loc[oz_trade['Element']=='Export Quantity']

# import/ export livestock
oz_livestock_imports = oz_imports.loc[oz_imports['Unit'].str.contains('head', case=False)]
oz_livestock_exports = oz_exports.loc[oz_exports['Unit'].str.contains('head', case=False)]
oz_livestock_imports.rename(columns={'Item': 'Animal Type'}, inplace=True)
oz_livestock_exports.rename(columns={'Item': 'Animal Type'}, inplace=True)

# import/ export meat products
oz_meat_imports = oz_imports.loc[oz_imports['Crop_Livestock'].str.contains('meat', case=False)]
oz_meat_exports = oz_exports.loc[oz_exports['Crop_Livestock'].str.contains('meat', case=False)]
oz_meat_imports.rename(columns={'Item': 'Meat Type'}, inplace=True)
oz_meat_exports.rename(columns={'Item': 'Meat Type'}, inplace=True)

# import/ export dairy products
oz_dairy_imports = oz_imports.loc[oz_imports['Crop_Livestock'].str.contains('milk', case=False)]
oz_dairy_exports = oz_exports.loc[oz_exports['Crop_Livestock'].str.contains('milk', case=False)]
oz_dairy_imports.rename(columns={'Item': 'Dairy Type'}, inplace=True)
oz_dairy_exports.rename(columns={'Item': 'Dairy Type'}, inplace=True)

# import/ export crops
aus_imports_tonnes = oz_imports.loc[oz_imports['Unit'].str.contains('tonne', case=False)]
aus_exports_tonnes = oz_exports.loc[oz_exports['Unit'].str.contains('tonne', case=False)]
oz_crop_imports = aus_imports_tonnes.loc[aus_imports_tonnes['Crop_Livestock'].str.contains('meat', case=False) == False]
oz_crop_exports = aus_exports_tonnes.loc[aus_exports_tonnes['Crop_Livestock'].str.contains('meat', case=False) == False]
oz_crop_imports.rename(columns={'Item': 'Crop Type'}, inplace=True)
oz_crop_exports.rename(columns={'Item': 'Crop Type'}, inplace=True)


oz_livestock_imports.head()
oz_meat_imports.head()
oz_dairy_imports.head()
oz_crop_imports.head()

oz_livestock_exports.head()
oz_meat_exports.head()
oz_dairy_exports.head()
oz_crop_exports.head()

         Country Crop_Livestock          Element  Unit  Year  Value
622    Australia         Horses  Import Quantity  Head  1961  300.0
1522   Australia     Other food  Import Quantity  Head  1961  300.0
16849  Australia         Horses  Import Quantity  Head  1962  300.0
17749  Australia     Other food  Import Quantity  Head  1962  300.0
33076  Australia         Horses  Import Quantity  Head  1963  311.0

        Country         Crop_Livestock          Element    Unit  Year   Value
767   Australia             Meal, meat  Import Quantity  tonnes  1961   470.0
771   Australia               Meat nes  Import Quantity  tonnes  1961   650.0
791   Australia  Meat, chicken, canned  Import Quantity  tonnes  1961   953.0
1456  Australia           Poultry Meat  Import Quantity  tonnes  1961  1382.0
1464  Australia             Other Meat  Import Quantity  tonnes  1961   650.0

,Country,Crop_Livestock,Element,Unit,Year,Value
227,Australia,"Cheese, whole cow milk",Import Quantity,tonnes,1961,1567.0
863,Australia,"Milk, whole dried",Import Quantity,tonnes,1961,865.0
16454,Australia,"Cheese, whole cow milk",Import Quantity,tonnes,1962,1907.0
17090,Australia,"Milk, whole dried",Import Quantity,tonnes,1962,124.0
32681,Australia,"Cheese, whole cow milk",Import Quantity,tonnes,1963,2422.0

,Country,Crop_Livestock,Element,Unit,Year,Value
76,Australia,"Beans, dry",Import Quantity,tonnes,1961,4035.0
88,Australia,Beer of barley,Import Quantity,tonnes,1961,300.0
100,Australia,"Beverages, distilled alcoholic",Import Quantity,tonnes,1961,15790.0
104,Australia,"Beverages, non alcoholic",Import Quantity,tonnes,1961,100.0
120,Australia,Bread,Import Quantity,tonnes,1961,1000.0

        Country Crop_Livestock          Element  Unit  Year     Value
209   Australia         Cattle  Export Quantity  Head  1961   10200.0
625   Australia         Horses  Export Quantity  Head  1961     400.0
1089  Australia           Pigs  Export Quantity  Head  1961     100.0
1193  Australia          Sheep  Export Quantity  Head  1961  147600.0
1526  Australia     Other food  Export Quantity  Head  1961  158300.0

,Country,Crop_Livestock,Element,Unit,Year,Value
769,Australia,"Meal, meat",Export Quantity,tonnes,1961,3690.0
777,Australia,"Meat, beef, preparations",Export Quantity,tonnes,1961,11122.0
781,Australia,"Meat, cattle",Export Quantity,tonnes,1961,550.0
785,Australia,"Meat, cattle, boneless (beef & veal)",Export Quantity,tonnes,1961,145614.0
789,Australia,"Meat, chicken",Export Quantity,tonnes,1961,191.0

       Country          Crop_Livestock          Element    Unit  Year    Value
139  Australia        Butter, cow milk  Export Quantity  tonnes  1961  62118.0
229  Australia  Cheese, whole cow milk  Export Quantity  tonnes  1961  18326.0
857  Australia     Milk, skimmed dried  Export Quantity  tonnes  1961  15300.0
861  Australia   Milk, whole condensed  Export Quantity  tonnes  1961  17322.0
865  Australia       Milk, whole dried  Export Quantity  tonnes  1961   7120.0

      Country  Crop_Livestock          Element    Unit  Year     Value
24  Australia          Apples  Export Quantity  tonnes  1961  109140.0
58  Australia   Bacon and ham  Export Quantity  tonnes  1961     180.0
70  Australia          Barley  Export Quantity  tonnes  1961  768800.0
90  Australia  Beer of barley  Export Quantity  tonnes  1961    7000.0
94  Australia         Beeswax  Export Quantity  tonnes  1961      90.0